{
    "profile": {
        "profile": "Informatics and Computing Engineering Student",
        "profileDescription": "Informatics and Computing Engineering student currently in the third year, consistent and committed worker, as well as an excellent partner of work. Software development and artificial intelligence (particularly machine learning) are his favorite areas."
    },
    "education": {
        "education": "Education",
        "feup": {
            "institution": "Faculty of Engineering at the University of Porto",
            "timeline": "Present"
        },
        "liceu": {
            "institution": "Latino Coelho Highschool"
        }
    },
    "experience": {
        "UPDigital": {
            "name": "UPDigital",
            "type": "Summer Internship",
            "startDate": "July 2024",
            "endDate": "September 2024",
            "technologies": "Typescript, Next.js, Node.js, Django, PostgreSQL, Docker, Tailwindcss",
            "description": "Development of a web application for the management of Student Scholarships."

        },
        "NIAEFEUP": {
            "name": "NIAEFEUP",
            "type": "Events Coordinator",
            "startDate": "June 2024",
            "endDate": "Present",
            "description": "Member of the NIAEFEUP as coordinator of the Events department in a school group with 100+ active members. Coordination of a team with 15 members."
        },
        "SkySIGMA": {
            "name": "SkySIGMA",
            "type": "Curricular Internship",
            "about": "Development of modular HR software",
            "startDate": "February 2024",
            "endDate": "July 2024",
            "technologies": "Codeigniter, PHP, MySQL, Javascript, Bitbucket",
            "description": "Development of a multi-company software module dedicated to human resources management."
        }
    },
    "extraCurricular": {
        "description": "IT Support Technician European Elections 2024 : Support in the process of dematerialization of electoral rolls | FEUP Mentoring : Integration of 1st year students | React The Complete Guide 2023 by Maximilian Schwarzmüller : Udemy platform course | Member of the Lamego-Bouchemaine Gemination Association"
    },
    "projects": {
        "projects" : "Projects",
        "project1": {
            "name": "TSP Heuristic Solver",
            "description": "The Traveling Salesman Problem (TSP) is a classic optimization problem in the field of computer science. This project tries to solve it using various optimization techniques and algorithms, including backtracking, triangular approximation, Christofides algorithm and a meta-heuristic approach - Simulated Annealing. ",
            "technologies": "cplusplus"
        },
        "project2" : {
            "name": "Water Supply System Management",
            "description": "This project involves the development of a C++ application designed to manage and optimize a water supply system. The application leverages the Edmonds-Karp algorithm. The system incorporates various heuristics to identify optimal points for adding or removing pipes without disrupting the overall efficiency and functionality of the network. ",
            "technologies": "cplusplus"
        },
        "project3" : {
         "name": "Banking-Customer-Churn-Prediction",
         "description": "A project that applies supervised learning algorithms to a bank dataset, focusing on whether a customer is at risk of churning.",
         "technologies": "python, scikit-learn, pandas, numpy, matplotlib, seaborn"
        },
        "project4" : {
            "name": "Even More Pizza - Google Hashcode 2021",
            "description": "This project aims to implement a solution for the Even More Pizza problem from the Hash Code competition. Multiple optimization algorithms with different parameterizations were developed. Additionally, an interface was added to help users experiment and learn about the algorithms' performance.",
            "technologies": "python"
        }
        
    }
}